-- MySQL dump 10.13  Distrib 8.0.27, for Linux (x86_64)
--
-- Host: localhost    Database: syes
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `auction`
--

DROP TABLE IF EXISTS `auction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `auction` (
  `id` int NOT NULL AUTO_INCREMENT,
  `userid` varchar(64) DEFAULT NULL,
  `itemid` int DEFAULT NULL,
  `price` float NOT NULL,
  `time` timestamp NULL DEFAULT NULL,
  `apply` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `auction_id_uindex` (`id`),
  KEY `auction_item_id_fk` (`itemid`),
  KEY `auction_user_id_fk` (`userid`),
  CONSTRAINT `auction_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`),
  CONSTRAINT `auction_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='竞价表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `auction`
--

LOCK TABLES `auction` WRITE;
/*!40000 ALTER TABLE `auction` DISABLE KEYS */;
INSERT INTO `auction` VALUES (11,'20201313014',76,15,'2022-09-16 21:56:25',1),(12,'20201313014',81,150,'2022-09-16 22:41:57',1),(13,'20201313061',77,99,'2022-09-16 16:32:22',0),(14,'20201313062',77,98,'2022-09-16 16:32:23',0),(15,'20201313063',77,97,'2022-09-16 16:32:24',1),(18,'20201313013',80,20,'2022-09-16 17:24:19',0),(20,'20201313014',75,50,'2022-09-16 22:30:16',0),(21,'20201313014',77,150,'2022-09-17 10:15:27',1),(22,'20201313059',86,50,'2022-09-29 23:55:05',1),(23,'20201313057',87,10,'2022-09-30 08:31:45',1),(24,'20201313059',87,11,'2022-09-30 08:31:58',1),(25,'20201313056',85,0.5,'2022-09-30 23:22:35',0),(26,'20201313014',89,250,'2022-10-03 14:44:55',1),(27,'20201313013',82,250,'2022-10-05 08:57:13',1);
/*!40000 ALTER TABLE `auction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chat`
--

DROP TABLE IF EXISTS `chat`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chat` (
  `id` int NOT NULL AUTO_INCREMENT,
  `userid` varchar(64) NOT NULL,
  `touserid` varchar(64) NOT NULL,
  `content` text NOT NULL,
  `createtime` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `enable` tinyint(1) DEFAULT '1',
  `readed` int DEFAULT '1' COMMENT '是否已读，默认已读',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=162 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chat`
--

LOCK TABLES `chat` WRITE;
/*!40000 ALTER TABLE `chat` DISABLE KEYS */;
INSERT INTO `chat` VALUES (2,'10','11','ARE YOU OK ?','2022-09-24 17:18:33',1,1),(4,'11','10','你故意找茬是不是，你要不要吧！','2022-09-24 20:19:25',1,1),(5,'11','10','我开水果摊的，能卖给你生瓜蛋子？','2022-09-24 20:18:52',1,1),(6,'11','10','萨日朗萨日朗','2022-09-24 20:19:55',1,1),(7,'10','11','开着小电驴走人','2022-09-24 20:20:26',1,1),(8,'10','11','我问你这瓜保熟吗？','2022-09-24 20:19:13',1,1),(9,'10','11','你这瓜保熟吗','2022-09-24 20:18:30',1,1),(11,'11','10','萨日朗！萨日朗！','2022-09-25 19:01:27',1,1),(12,'11','10','萨日朗萨日朗','2022-09-24 20:19:55',1,1),(13,'11','10','我开水果摊的，能卖给你生瓜蛋子？','2022-09-24 20:18:52',1,1),(14,'11','10','你故意找茬是不是，你要不要吧！','2022-09-24 20:19:25',1,1),(15,'10','10','ARE YOU OK ?','2022-09-24 17:08:23',1,1),(16,'10','11','你这瓜保熟吗','2022-09-24 20:18:30',1,1),(17,'10','11','我问你这瓜保熟吗？','2022-09-24 20:19:13',1,1),(18,'10','10','ARE YOU OK ?','2022-09-24 17:08:23',1,1),(19,'10','11','你这瓜保熟吗','2022-09-24 20:18:30',1,1),(20,'10','11','我问你这瓜保熟吗？','2022-09-24 20:19:13',1,1),(21,'10','10','ARE YOU OK ?','2022-09-24 17:08:23',1,1),(22,'10','11','你这瓜保熟吗','2022-09-24 20:18:30',1,1),(23,'10','11','我问你这瓜保熟吗？','2022-09-24 20:19:13',1,1),(24,'10','10','ARE YOU OK ?','2022-09-24 17:08:23',1,1),(25,'10','11','你这瓜保熟吗','2022-09-24 20:18:30',1,1),(26,'10','11','我问你这瓜保熟吗？','2022-09-24 20:19:13',1,1),(27,'10','10','ARE YOU OK ?','2022-09-24 17:08:23',1,1),(28,'10','11','你这瓜保熟吗','2022-09-24 20:18:30',1,1),(29,'10','10','测试6','2022-09-25 19:53:39',1,1),(30,'10','11','我问你这瓜保熟吗？','2022-09-24 20:19:13',1,1),(31,'10','11','测试7','2022-09-25 19:54:56',1,1),(32,'10','11','测试8','2022-09-25 19:59:34',1,1),(33,'10','11','测试9','2022-09-26 21:46:59',1,1),(34,'10','11','测试10','2022-09-26 21:48:37',1,1),(35,'10','11','测试11','2022-09-26 21:52:41',1,1),(36,'10','11','测试12','2022-09-26 21:54:21',1,1),(37,'10','11','测试12','2022-09-26 22:18:18',1,1),(38,'10','11','测试13','2022-09-26 22:36:12',1,1),(39,'10','11','测试14','2022-09-26 22:41:10',1,1),(40,'10','11','测试15','2022-09-26 22:44:02',1,1),(41,'10','11','测试16','2022-09-26 22:44:27',1,1),(42,'10','11','测试17','2022-09-27 12:58:00',1,1),(43,'10','11','测试18','2022-09-27 13:01:14',1,1),(44,'10','11','测试19','2022-09-27 13:02:51',1,1),(45,'10','11','测试完成','2022-09-27 13:03:02',1,1),(46,'10','11','这次能不出警告了吗','2022-09-27 13:21:18',1,1),(47,'10','11','啊？','2022-09-27 13:21:37',1,1),(48,'10','11','这次必须成功','2022-09-27 13:21:56',1,1),(49,'10','11','测试20','2022-09-27 13:22:20',1,1),(50,'10','11','1','2022-09-27 13:22:23',1,1),(51,'10','11','这个只能用push','2022-09-27 13:23:13',1,1),(52,'10','11','时间不对啊','2022-09-27 13:24:01',1,1),(53,'10','11','这次不报警告了？','2022-09-27 13:24:26',1,1),(54,'10','11','哈哈完成啦','2022-09-27 13:25:40',1,1),(55,'10','11','时间好了吗','2022-09-27 13:27:30',1,1),(56,'10','11','试试时间','2022-09-27 13:28:20',1,1),(57,'10','11','再试试','2022-09-27 13:28:34',1,1),(58,'10','11','再试试','2022-09-27 13:29:13',1,1),(59,'10','11','哈哈','2022-09-27 13:29:26',1,1),(60,'10','11','20行不行','2022-09-27 13:29:38',1,1),(61,'10','11','行不行呢','2022-09-27 13:57:07',1,1),(62,'11','10','你故意找茬是不是，你要不要吧！','2022-09-24 20:19:25',1,1),(63,'11','10','我开水果摊的，能卖给你生瓜蛋子？','2022-09-24 20:18:52',1,1),(64,'11','10','萨日朗萨日朗','2022-09-24 20:19:55',1,1),(65,'11','10','肯定性啊','2022-09-27 13:59:49',1,1),(66,'11','10','要是都在线呢','2022-09-27 14:00:45',1,1),(67,'10','11','我超','2022-09-27 14:00:49',1,1),(68,'10','11','居然是关键字','2022-09-27 14:17:12',1,1),(69,'10','11','终于没事了吗','2022-09-27 15:06:29',1,1),(70,'11','11','没消息？','2022-09-27 15:08:01',1,0),(71,'11','11','一条','2022-09-27 15:08:05',1,0),(72,'11','10','没事了吧','2022-09-27 15:08:46',1,1),(73,'10','11','真的没事了吗','2022-09-27 15:21:24',1,1),(74,'11','10','真的','2022-09-27 15:21:55',1,1),(75,'10','11','没问题','2022-09-28 13:36:12',1,1),(76,'10','11','发一条信息','2022-09-28 15:51:47',1,1),(77,'10','11','？？','2022-09-28 16:14:36',1,1),(78,'11','10','？','2022-09-28 16:14:26',1,1),(79,'11','10','海绵宝宝1','2022-09-28 16:18:50',1,1),(80,'11','10','海绵宝宝1','2022-09-28 16:18:50',1,1),(81,'11','10','回答2','2022-09-28 16:20:39',1,1),(82,'11','10','回答2','2022-09-28 16:20:39',1,1),(83,'11','10','是的船长','2022-09-28 16:18:01',1,1),(84,'11','10','是的船长','2022-09-28 16:18:01',1,1),(85,'11','10','回答1','2022-09-28 16:20:31',1,1),(86,'11','10','海绵宝宝3','2022-09-28 16:19:30',1,1),(87,'11','10','回答1','2022-09-28 16:20:31',1,1),(88,'11','10','海绵宝宝1','2022-09-28 16:17:01',1,1),(89,'11','10','海绵宝宝3','2022-09-28 16:19:30',1,1),(90,'11','10','好的船长','2022-09-28 16:18:20',1,1),(91,'11','10','海绵宝宝1','2022-09-28 16:17:01',1,1),(92,'11','10','海绵宝宝2','2022-09-28 16:19:06',1,1),(93,'11','10','好的船长','2022-09-28 16:18:20',1,1),(94,'11','10','海绵宝宝2','2022-09-28 16:19:06',1,1),(95,'10','11','我听不见','2022-09-28 16:18:15',1,1),(96,'10','11','方方黄黄伸缩自如','2022-09-28 16:19:00',1,1),(97,'10','11','问题2','2022-09-28 16:20:43',1,1),(98,'10','11','是谁住在深海的大菠萝里？','2022-09-28 16:16:53',1,1),(99,'10','11','准备好了吗孩子们？','2022-09-28 16:17:50',1,1),(100,'10','11','是谁住在深海的大菠萝里？','2022-09-28 16:18:35',1,1),(101,'10','11','问题1','2022-09-28 16:20:27',1,1),(102,'10','11','如果四处探险是你的愿望','2022-09-28 16:19:21',1,1),(103,'11','10','test','2022-09-28 16:26:16',1,1),(104,'10','11','什么情况会有两次消息？','2022-09-28 16:29:32',1,1),(105,'11','10','不知道啊','2022-09-28 16:29:42',1,1),(106,'11','10','滚动到底部？','2022-09-28 17:05:52',1,1),(107,'10','11','试试','2022-09-28 17:16:02',1,1),(108,'10','11','奥','2022-09-28 17:16:05',1,1),(109,'11','10','不行啊？','2022-09-28 17:16:59',1,1),(110,'11','10','行了行了','2022-09-28 17:18:52',1,1),(111,'10','11','应该算是行了','2022-09-28 17:30:21',1,1),(112,'10','12','多条消息测试1','2022-09-28 19:45:44',1,1),(113,'11','12','多条消息测试1','2022-09-28 19:45:45',1,0),(114,'11','12','多条消息测试2','2022-09-28 19:46:44',1,0),(115,'11','12','这个也应该是显示的消息','2022-09-28 19:46:45',1,0),(116,'10','12','多条消息测试3','2022-09-28 19:46:46',1,1),(117,'10','12','多条消息测试3','2022-09-28 19:46:46',1,1),(118,'10','12','这应该是显示的消息','2022-09-28 19:46:47',1,1),(119,'14','12','历史消息','2022-09-29 08:47:50',1,1),(120,'14','12','历史消息','2022-09-29 08:47:52',1,1),(121,'14','12','这个是应该显示的历史消息','2022-09-29 08:47:53',1,1),(122,'15','12','历史消息','2022-09-29 08:48:26',1,1),(123,'15','12','历史消息','2022-09-29 08:48:27',1,1),(124,'15','12','历史消息','2022-09-29 08:48:29',1,1),(125,'15','12','这个是应该显示的历史消息','2022-09-29 08:48:34',1,1),(126,'17','12','历史消息','2022-09-29 08:48:32',1,1),(127,'15','201','我是学生五十包邮','2022-09-29 23:57:12',1,1),(128,'201','15','不卖。','2022-09-29 23:57:35',1,1),(129,'201','15','不行','2022-09-29 23:57:20',1,1),(130,'201','15','自提，要么退款','2022-09-29 23:57:42',1,1),(131,'15','201','wdnmd','2022-09-29 23:57:41',1,1),(132,'15','201','你给不给吧','2022-09-29 23:57:29',1,1),(133,'15','6','五块卖给我','2022-09-30 08:33:36',1,1),(134,'6','15','🐔','2022-09-30 08:33:48',1,1),(135,'15','6','草','2022-09-30 08:33:55',1,1),(136,'6','15','点击[http://img03.sogoucdn.com/app/a/200678/c42a253c6beb8164a364617d26d01ab8.jpg]查看表情','2022-09-30 08:40:37',1,1),(137,'15','10','图片上传','2022-09-30 09:09:43',1,1),(138,'15','201','哈哈','2022-09-30 09:11:34',1,1),(139,'15','201','？','2022-09-30 09:11:53',1,1),(140,'15','10','发一条消息','2022-09-30 09:12:47',1,1),(141,'10','15','a ','2022-09-30 09:16:34',1,1),(142,'15','10','谁啊这都是','2022-09-30 09:17:11',1,1),(143,'15','10','消息有延迟','2022-09-30 09:18:58',1,1),(144,'15','10','消息延迟测试','2022-09-30 09:20:25',1,1),(145,'10','12','短','2022-09-30 09:55:42',1,1),(146,'10','12','我脚着你没看到这个','2022-09-30 11:18:41',1,0),(147,'10','12','10给的消息','2022-09-30 13:44:40',1,1),(148,'11','12','11给的消息','2022-09-30 13:44:40',1,1),(149,'14','12','14给的消息','2022-09-30 13:44:40',1,1),(150,'15','12','15给的消息','2022-09-30 13:44:40',1,1),(151,'15','11','你这瓜多少钱一斤？','2022-09-30 22:27:43',1,1),(152,'11','15','两块钱一斤','2022-09-30 22:29:36',1,1),(153,'10','202','？？？','2022-09-30 23:22:59',1,1),(154,'202','10','123','2022-09-30 23:23:09',1,1),(155,'10','202','50包邮','2022-09-30 23:23:08',1,1),(156,'10','202','。。。','2022-09-30 23:23:23',1,1),(157,'11','10','一条消息','2022-10-01 08:19:08',1,1),(158,'11','10','两条消息','2022-10-01 08:19:12',1,1),(159,'15','10','三条消息','2022-10-01 08:19:28',1,1),(160,'15','10','四条消息','2022-10-01 08:19:31',1,1),(161,'15','11','？','2022-10-01 20:24:52',1,0);
/*!40000 ALTER TABLE `chat` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `id` int NOT NULL AUTO_INCREMENT,
  `itemid` int NOT NULL,
  `userid` varchar(64) NOT NULL,
  `createtime` timestamp NOT NULL,
  `content` varchar(10000) NOT NULL,
  `touserid` varchar(64) DEFAULT NULL,
  `fromcommentid` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `comment_id_uindex` (`id`),
  KEY `comment_user_id_fk` (`userid`),
  KEY `comment_item_id_fk` (`itemid`),
  CONSTRAINT `comment_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`),
  CONSTRAINT `comment_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=84 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品评论';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES (3,1,'20201313014','2022-08-23 19:13:55','优菈，四哈斯哈','1',1),(5,1,'20201313014','2022-08-23 19:22:13','优菈，斯哈斯哈','1',1),(6,1,'20201313014','2022-08-23 19:22:14','优菈，斯哈斯哈','1',1),(7,1,'20201313014','2022-08-23 19:22:14','优菈，斯哈斯哈','1',1),(8,1,'20201313014','2022-08-23 19:22:15','优菈，斯哈斯哈','1',1),(9,1,'20201313013','2022-08-23 19:22:15','优菈，斯哈斯哈','1',1),(10,1,'20201313013','2022-08-23 19:22:16','优菈，斯哈斯哈','1',1),(11,1,'20201313013','2022-08-23 19:22:16','优菈，斯哈斯哈','1',1),(12,1,'20201313013','2022-08-23 19:22:17','优菈，斯哈斯哈','1',1),(13,1,'20201313013','2022-08-23 19:22:17','优菈，斯哈斯哈','1',1),(14,1,'20201313013','2022-08-23 19:22:18','优菈，斯哈斯哈','1',1),(15,1,'20201313013','2022-08-23 19:22:18','优菈，斯哈斯哈','1',1),(16,1,'20201313013','2022-08-23 19:22:19','优菈，斯哈斯哈','1',1),(17,1,'20201313013','2022-08-23 19:22:19','优菈，斯哈斯哈','1',1),(18,1,'20201313013','2022-08-23 19:22:20','优菈，斯哈斯哈','1',1),(19,1,'20201313013','2022-08-23 19:22:20','优菈，斯哈斯哈','1',1),(20,1,'20201313013','2022-08-23 19:22:21','优菈，斯哈斯哈','1',1),(21,1,'20201313013','2022-08-23 19:22:21','优菈，斯哈斯哈','1',1),(22,1,'20201313013','2022-08-23 19:22:22','优菈，斯哈斯哈','1',1),(23,1,'20201313013','2022-08-23 19:22:22','优菈，斯哈斯哈','1',1),(24,1,'20201313013','2022-08-23 19:22:23','优菈，斯哈斯哈','1',1),(25,1,'20201313013','2022-08-23 19:22:23','优菈，斯哈斯哈','1',1),(26,1,'20201313013','2022-08-23 19:22:23','优菈，斯哈斯哈','1',1),(27,1,'20201313013','2022-08-23 19:22:24','优菈，斯哈斯哈','1',1),(28,1,'20201313013','2022-08-23 19:22:24','优菈，斯哈斯哈','1',1),(29,1,'20201313013','2022-08-23 19:22:25','优菈，斯哈斯哈','1',1),(30,1,'20201313013','2022-08-23 19:22:25','优菈，斯哈斯哈','1',1),(31,1,'20201313013','2022-08-23 19:22:25','优菈，斯哈斯哈','1',1),(32,1,'20201313013','2022-08-23 19:22:29','优菈，斯哈dsfdasdfa斯哈','1',1),(33,3,'20201313013','2022-08-23 19:22:36','优菈，斯哈dsfdasdfa斯哈','1',1),(38,3,'20201313013','2022-08-24 21:46:29','我是学生，倒贴我五百',NULL,NULL),(39,3,'20201313060','2022-08-24 22:05:30','RTX3090显卡十片，女生自用99新','2',2),(60,77,'20201313013','2022-09-01 16:41:18','这瓜保熟吗？',NULL,NULL),(61,77,'20201313014','2022-09-02 16:42:09','我开水果摊的，能买你生瓜蛋子？','20201313013',60),(62,77,'20201313013','2022-09-03 16:42:52','我问你这瓜保熟吗？','20201313014',60),(63,77,'20201313014','2022-09-04 16:43:30','你故意找茬是不是？你要不要吧？','20201313013',60),(64,77,'20201313014','2022-09-05 16:44:02','我是学生，50包邮给我',NULL,NULL),(65,77,'20201313013','2022-09-07 16:44:30','你是畜生也不行','20201313014',64),(66,76,'20201313013','2022-09-08 17:44:07','发一条友善的评论',NULL,NULL),(67,76,'20201313013','2022-09-08 17:50:53','发第二条友善的评论',NULL,NULL),(68,76,'20201313013','2022-09-08 19:59:52','怎么就发不了评论了？',NULL,NULL),(69,77,'20201313063','2022-09-08 20:03:17','1',NULL,NULL),(70,77,'20201313013','2022-09-09 09:49:54','你这要是熟的我肯定要啊','20201313014',60),(71,77,'20201313013','2022-09-09 09:50:30','你来晚了，刚刚五毛钱卖出去了','20201313014',64),(73,75,'20201313013','2022-09-09 09:59:38','哈哈，终于可以评论了！','20201313013',72),(74,77,'20201313014','2022-09-09 10:02:46','WDNMD','20201313013',64),(75,75,'20201313014','2022-09-09 10:03:07','终于可以聊天了！','20201313013',72),(77,79,'20201313014','2022-09-16 08:58:30','到底行不行啊',NULL,NULL),(79,77,'20201313013','2022-09-24 23:59:14','cou（西瓜刀插入）','20201313014',60),(80,79,'20201313013','2022-09-25 00:20:03','太行了','20201313014',77),(81,87,'20201313059','2022-09-30 08:31:44','垃圾，狗都不买',NULL,NULL),(82,87,'20201313057','2022-09-30 08:32:03','别抬价',NULL,NULL),(83,90,'20201313013','2022-10-05 08:56:10','什么邪神',NULL,NULL);
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `file`
--

DROP TABLE IF EXISTS `file`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `file` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `type` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `size` mediumtext CHARACTER SET utf8 NOT NULL,
  `url` varchar(255) CHARACTER SET utf8 NOT NULL,
  `userid` varchar(64) CHARACTER SET utf8 NOT NULL,
  `md5` varchar(255) CHARACTER SET utf8 NOT NULL,
  `is_delete` tinyint(1) NOT NULL DEFAULT '0',
  `enable` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `createtime` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `file_id_uindex` (`id`),
  UNIQUE KEY `file_name_uindex` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=159 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='图片文件';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `file`
--

LOCK TABLES `file` WRITE;
/*!40000 ALTER TABLE `file` DISABLE KEYS */;
INSERT INTO `file` VALUES (15,'pic(1).jpg','jpg','123','https://img.hasdsd.cn/img/pic (1).jpg','20201313013','114514',0,NULL,'2022-08-25 14:32:56'),(16,'pic2','jpg','123','https://img.hasdsd.cn/img/pic2.png','20201313013','114514',1,NULL,'2022-08-25 14:38:34'),(17,'miyu.jpg','jpg','123','https://img.hasdsd.cn/img/muyu.jpg','20201313013','114514',0,NULL,'2022-08-25 16:48:48'),(18,'node','jpg','456','https://img.hasdsd.cn/img/node.png','20201313014','14514',0,NULL,'2022-08-25 16:52:58'),(31,'图片1.jpg','.jpg','65533','http://192.168.31.100:8000/file/img/cmf41vcmxtdl.jpg','20201313013','f265579d6aa95519fdaf410b337a15ae',0,NULL,NULL),(32,'rem.png','.png','456915','http://192.168.31.100:8000/file/img/cmf437qwyqw4.png','20201313013','ff4aafa3e719dd426c6caffa558b3a77',0,NULL,'2022-08-25 20:34:28'),(33,'pic (5).jpg','.jpg','121799','http://192.168.31.100:8000/file/img/cmf43ho506d4.jpg','20201313013','1e9a3a4342931dc917d3e144b0995605',0,NULL,'2022-08-25 20:34:49'),(34,'pic (3).png','.png','113404','http://192.168.31.100:8000/file/img/cmf43n3tsfek.png','20201313013','2007859cd5d4c3be3f30d7c4b1f8d099',0,NULL,'2022-08-25 20:35:01'),(35,'pic (4).png','.png','543945','http://192.168.31.100:8000/file/img/cmf43oj487de.png','20201313013','f0eb0f4502067ff743db4665ce3295ff',0,NULL,'2022-08-25 20:35:04'),(36,'pic (36).png','.png','197256','http://192.168.31.100:8000/file/img/cmf43tp4ywed.png','20201313013','a9deef73d8521f567eaa1f5cdc7ef88d',0,NULL,'2022-08-25 20:35:15'),(37,'pic (31).png','.png','263643','http://192.168.31.100:8000/file/img/19fwt7kx9z1n.png','20201313013','bd1d09dd743a2ed363efa2c000d3ebf1',0,NULL,'2022-08-25 20:35:37'),(38,'pic (20).png','.png','88653','http://192.168.31.100:8000/file/img/cmf45rqv0p61.png','20201313013','d7974c2502c32a0a389270c901877d34',0,NULL,'2022-08-25 20:37:48'),(39,'pic (19).png','.png','406934','http://192.168.31.100:8000/file/img/cmf45rqxdamj.png','20201313013','fce17ac8707c0486e7fff9da73393adb',0,NULL,'2022-08-25 20:37:48'),(40,'xianka1','.png','114514','https://img.hasdsd.cn/img/1661820629476.jpg','20201313013','123123',0,NULL,'2022-08-30 16:08:45'),(41,'xianka2','.png','114514','https://img.hasdsd.cn/img/1661820629484.jpg','20201313013','123123',0,NULL,'2022-08-30 16:08:46'),(42,'xianka3','.png','114514','https://img.hasdsd.cn/img/1661820629499.jpg','20201313013','123123',0,NULL,'2022-08-30 16:08:47'),(43,'xianka4','.png','114514','https://img.hasdsd.cn/img/1661820629507.jpg','20201313013','123123',0,NULL,'2022-08-30 16:08:48'),(44,'xianka5','.png','114514','https://img.hasdsd.cn/img/1661820629513.jpg','20201313013','123123',0,NULL,'2022-08-30 16:08:49'),(45,'xianka6','.png','114514','https://img.hasdsd.cn/img/1661820629529.jpg','20201313013','123123',0,NULL,'2022-08-30 16:08:52'),(46,'6D1FCC69C66EDFCAFCE0A867180472C2.jpg','.jpg','28192','http://192.168.31.100:8000/file/img/19gblz7ko4cf.jpg','undefined','8046d083d9f6a8b8a6e5ff7569f46514',0,NULL,'2022-08-30 16:33:57'),(47,'EOSBootStrapper.exe','.exe','816640','http://192.168.31.100:8000/file/img/cmkv3nutss11.exe','优菈','7d3fdfb82c866f41152d5e1f56d1060c',0,NULL,'2022-09-01 14:48:02'),(48,'EOSBootStrapper.ini','.ini','88','http://192.168.31.100:8000/file/img/cmkv3sisbkqj.ini','优菈','299c06162f104c90cbf03eca8a0518f8',0,NULL,'2022-09-01 14:48:07'),(49,'FallGuys_client.exe','.exe','816640','http://192.168.31.100:8000/file/img/cmkv3nutss11.exe','优菈','7d3fdfb82c866f41152d5e1f56d1060c',0,NULL,'2022-09-01 14:48:09'),(50,'FallGuys_client.ini','.ini','92','http://192.168.31.100:8000/file/img/cmkv3vi3cjoe.ini','优菈','b8cce820b2283bcae8f0668435ff763e',0,NULL,'2022-09-01 14:48:10'),(51,'FallGuys_client_game.exe','.exe','650752','http://192.168.31.100:8000/file/img/cmkv3vstgvfi.exe','优菈','d4366e5c4a0b7eb119d6199c5e43c22a',0,NULL,'2022-09-01 14:48:10'),(55,'ad.png','.png','18776','http://192.168.31.100:8000/file/img/cmlo7r0jbigt.png','undefined','6b221d1517dff24a6aca8a1de8fb5922',0,NULL,'2022-09-02 13:36:45'),(58,'axios.png','.png','29083','http://192.168.31.100:8000/file/img/cmlohy06qkov.png','undefined','52a4f5ba14234d3a547c880b6b072143',0,NULL,'2022-09-02 13:50:04'),(59,'git.png','.png','55102','http://192.168.31.100:8000/file/img/cmloigpfp70n.png','undefined','ad8b2caf809cb671fa15ce5aff5d0676',0,NULL,'2022-09-02 13:50:44'),(60,'minecraft.png','.png','250167','http://192.168.31.100:8000/file/img/cmlonovytcc5.png','undefined','249e65772dd04e7b411a9fabdbe1f516',0,NULL,'2022-09-02 13:57:34'),(61,'python.png','.png','159776','http://192.168.31.100:8000/file/img/cmlos37q4ads.png','20201313013','9d846309f646120541f0ff68e25b0589',0,NULL,'2022-09-02 14:03:19'),(62,'mybatis.png','.png','53494','http://192.168.31.100:8000/file/img/cmlosqb7qotv.png','undefined','1d3998fa6efb2e3c5c39efbd7a83c945',0,NULL,'2022-09-02 14:04:09'),(63,'spring.png','.png','45774','http://192.168.31.100:8000/file/img/cmlouge7opku.png','20201313013','7637839ad8164953e20b07d2ab6fe72e',0,NULL,'2022-09-02 14:06:24'),(64,'element.png','.png','196017','http://192.168.31.100:8000/file/img/cmlouw16crng.png','20201313013','351d24a44308076d4b7b277cd5ed420b',0,NULL,'2022-09-02 14:06:58'),(65,'java.png','.png','195093','http://192.168.31.100:8000/file/img/cmloz7dq762e.png','20201313013','37ccd5b212c9fcbc3b459718a7d21daf',0,NULL,'2022-09-02 14:12:36'),(66,'rediss.png','.png','47796','http://192.168.31.100:8000/file/img/cmlpaimabn3x.png','20201313013','d7fa6365b59209f506a422f019e921b7',0,NULL,'2022-09-02 14:27:23'),(67,'UnityCrashHandler64.exe','.exe','1076824','http://192.168.31.100:8000/file/img/cmlphk8n7b28.exe','1','74d428d8829af450a1549a880b6a0ea7',0,NULL,'2022-09-02 14:36:36'),(68,'devcppPortable.exe','.exe','174592','http://192.168.31.100:8000/file/img/19gkk4p1aji1.exe','1','69c6f85696c5542e5596dc8c51262845',0,NULL,'2022-09-02 14:41:29'),(69,'javas.png','.png','45381','http://192.168.31.100:8000/file/img/cmlrob29lhc4.png','undefined','5455a3e1953792ecbc57796ef0139cd1',0,NULL,'2022-09-02 16:19:26'),(70,'vuexs.png','.png','50094','http://192.168.31.100:8000/file/img/cmlrqnefpfbu.png','20201313013','5a5057eee338288be291e12a0e07f794',0,NULL,'2022-09-02 16:22:29'),(76,'mmd.png','.png','418979','http://192.168.31.100:8000/file/img/cmls2haetrdy.png','20201313013','cf29676ba50ff0ebe3d5c88dd430358b',0,NULL,'2022-09-02 16:37:56'),(77,'spring2.png','.png','28685','http://192.168.31.100:8000/file/img/19gn0zlt38d8.png','20201313013','f739a59adee2083cc593d4caf9b2ef90',0,NULL,'2022-09-03 10:02:02'),(78,'cmmeoe8dmnbf','.png','114588','http://192.168.31.100:8000/file/img/cmmeoe8dmnbf.png','20201313013','45b932b8ba89e00ce0e772388a2671d3',0,NULL,'2022-09-03 10:20:58'),(79,'cmmepdum6u8v','.png','75936','http://192.168.31.100:8000/file/img/cmmepdum6u8v.png','20201313013','5f9fe7cb27f1f3a59cc861f9d7ea7e22',0,NULL,'2022-09-03 10:22:16'),(80,'cmmeqigcg3pu','.png','114588','http://192.168.31.100:8000/file/img/cmmeoe8dmnbf.png','20201313013','45b932b8ba89e00ce0e772388a2671d3',0,NULL,'2022-09-03 10:23:44'),(81,'cmmeqqf29bsc','.png','93843','http://192.168.31.100:8000/file/img/cmmeqqf29bsc.png','20201313013','d50ffc632c1a29465337d11d74cb7b64',0,NULL,'2022-09-03 10:24:01'),(82,'cmmereo6g07g','.png','114588','http://192.168.31.100:8000/file/img/cmmeoe8dmnbf.png','20201313013','45b932b8ba89e00ce0e772388a2671d3',0,NULL,'2022-09-03 10:24:54'),(83,'cmmerl84l0fw','.png','214032','http://192.168.31.100:8000/file/img/cmmerl84l0fw.png','20201313013','76505cca4f0a5977a3ffcf4f2e2a46ae',0,NULL,'2022-09-03 10:25:08'),(84,'cmmery34x5xc','.png','598427','http://192.168.31.100:8000/file/img/cmmery34x5xc.png','20201313013','c27e2ffb59d7ff0fadc84a7fe45a84',0,NULL,'2022-09-03 10:25:36'),(85,'cmmerzxefvi6','.png','93843','http://192.168.31.100:8000/file/img/cmmeqqf29bsc.png','20201313013','d50ffc632c1a29465337d11d74cb7b64',0,NULL,'2022-09-03 10:25:40'),(86,'cmmesiu1c70j','.png','598427','http://192.168.31.100:8000/file/img/cmmery34x5xc.png','20201313013','c27e2ffb59d7ff0fadc84a7fe45a84',0,NULL,'2022-09-03 10:26:22'),(87,'cmmesk6qdvny','.png','93843','http://192.168.31.100:8000/file/img/cmmeqqf29bsc.png','20201313013','d50ffc632c1a29465337d11d74cb7b64',0,NULL,'2022-09-03 10:26:25'),(88,'cmmetgwutexp','.jpg','270437','http://192.168.31.100:8000/file/img/cmmetgwutexp.jpg','20201313013','935c02c9b3216a11ab8b171f2b56d9cf',0,NULL,'2022-09-03 10:27:36'),(89,'cmmew7oq141i','.png','163172','http://192.168.31.100:8000/file/img/cmmew7oq141i.png','20201313013','b31b21dbe518dc3d35ec712d1c54bf13',0,NULL,'2022-09-03 10:31:11'),(90,'cmmfqggas9c1','.png','344543','http://192.168.31.100:8000/file/img/cmmfqggas9c1.png','20201313013','fd680ce8495746750d69c497e8a951de',0,NULL,'2022-09-03 11:10:41'),(91,'cmmh83ovqg39','.jpg','99281','http://192.168.31.100:8000/file/img/cmmh83ovqg39.jpg','20201313013','63bdbf8586b8765522c125f6aad919e2',0,NULL,'2022-09-03 12:20:45'),(92,'cmmhj8wdqruh','.jpg','88199','http://192.168.31.100:8000/file/img/cmmhj8wdqruh.jpg','20201313013','fc41dfd25ccd7544bc4e7a11b39b996a',0,NULL,'2022-09-03 12:35:18'),(93,'cmmhlfriy9b5','.jpg','8829','http://192.168.31.100:8000/file/img/cmmhlfriy9b5.jpg','20201313013','b25ddd4ddd135f74cc17f9255c20df5a',0,NULL,'2022-09-03 12:38:10'),(94,'19gnd8p5fw7u','.jpg','878580','http://192.168.31.100:8000/file/img/19gnd8p5fw7u.jpg','20201313013','c1e8685f6e9b5a8b09f591d3b6a58327',0,NULL,'2022-09-03 12:42:03'),(95,'cmmhppyjmh5e','.jpg','886295','http://192.168.31.100:8000/file/img/cmmhppyjmh5e.jpg','20201313013','e35abda0a2e99e8527c7c3dcec560566',0,NULL,'2022-09-03 12:43:45'),(96,'cmmhqcrsoq3t','.jpg','195455','http://192.168.31.100:8000/file/img/cmmhqcrsoq3t.jpg','20201313013','978c56ee012c8ab8c504e434c6da2ff9',0,NULL,'2022-09-03 12:44:35'),(97,'19gndftn9ukb','.jpg','569233','http://192.168.31.100:8000/file/img/19gndftn9ukb.jpg','20201313013','558182c7cdea79ae6367cebac1ac7558',0,NULL,'2022-09-03 12:44:38'),(98,'cmmhrq33cmja','.jpg','25481','http://192.168.31.100:8000/file/img/cmmhrq33cmja.jpg','20201313013','4553ce9c4305e3e80e6ddf754e817f83',0,NULL,'2022-09-03 12:46:22'),(99,'cmmhrrxk5duw','.jpg','406792','http://192.168.31.100:8000/file/img/cmmhrrxk5duw.jpg','20201313013','99488844c059fef9ed8510257762102f',0,NULL,'2022-09-03 12:46:26'),(106,'19gnulfz1qxp','.jpg','92444','http://192.168.31.100:8000/file/img/19gnulfz1qxp.jpg','20201313013','e19801d058f048f9915a5dd6919d6adc',0,NULL,'2022-09-03 16:28:42'),(107,'cmmmrv3ws3lo','.jpg','27390','http://192.168.31.100:8000/file/img/cmmmrv3ws3lo.jpg','20201313013','72c69d5e48c08abe1f758f1ad3bedb80',0,NULL,'2022-09-03 16:41:39'),(108,'cmmmxio7c65p','.jpg','298279','http://192.168.31.100:8000/file/img/cmmmxio7c65p.jpg','20201313013','db2c71cc471cc5bf50b1b8ccfbf1ffa7',0,NULL,'2022-09-03 16:49:02'),(109,'cmmmxz020kwo','.jpg','37946','http://192.168.31.100:8000/file/img/cmmmxz020kwo.jpg','20201313013','34620c22a3476d1668046d0a6328f45e',0,NULL,'2022-09-03 16:49:38'),(114,'cmmnxhaadny5','.jpg','340831','http://192.168.31.100:8000/file/img/cmmnxhaadny5.jpg','20201313013','8a9a016caee034efb1907d896174f58f',0,NULL,'2022-09-03 17:36:00'),(115,'cmmo0ljpsj85','.jpg','225543','http://192.168.31.100:8000/file/img/cmmo0ljpsj85.jpg','20201313013','7d2d5f79ea8482375da3f8698893c5af',0,NULL,'2022-09-03 17:40:04'),(116,'cmmo2q5ibs46','.jpg','74102','http://192.168.31.100:8000/file/img/cmmo2q5ibs46.jpg','20201313013','57beccb9ae2cc937a3af32a4c92866c',0,NULL,'2022-09-03 17:42:51'),(117,'19go0drq1stf','.jpg','11398','http://192.168.31.100:8000/file/img/19go0drq1stf.jpg','20201313013','734e4cca4712bd386a297fad74d0ba26',0,NULL,'2022-09-03 17:44:17'),(118,'cmmozx87yc1a','.jpg','11598','http://192.168.31.100:8000/file/img/cmmozx87yc1a.jpg','20201313013','98349609cf4bb2de70111077d810a609',0,NULL,'2022-09-03 18:26:13'),(119,'cmmozyqepk99','.jpg','146978','http://192.168.31.100:8000/file/img/cmmozyqepk99.jpg','20201313013','5cbb0edc90bfdda45f24cdbc331e9f25',0,NULL,'2022-09-03 18:26:16'),(120,'cmn71po9unt5','.jpg','24496','http://192.168.31.100:8000/file/img/cmn71po9unt5.jpg','20201313013','a7e956a6fdd739241bc6c3027b0f84cc',0,NULL,'2022-09-04 08:34:53'),(121,'cmoauk9f9kmk','.jpeg','61135','http://192.168.31.100:8000/file/img/cmoauk9f9kmk.jpeg','20201313013','b8926b5bf72a4c646343b8d0cddef61d',0,NULL,'2022-09-05 15:46:17'),(122,'cmobl5td5b0r','.jpeg','61135','http://192.168.31.100:8000/file/img/cmoauk9f9kmk.jpeg','20201313013','b8926b5bf72a4c646343b8d0cddef61d',0,NULL,'2022-09-05 16:21:21'),(123,'cmoblgsbac5p','.jpeg','61135','http://192.168.31.100:8000/file/img/cmoauk9f9kmk.jpeg','20201313013','b8926b5bf72a4c646343b8d0cddef61d',0,NULL,'2022-09-05 16:21:25'),(124,'cmoblu20qmfd','.jpg','825504','http://192.168.31.100:8000/file/img/cmoblu20qmfd.jpg','20201313013','8570593c77a1aef961bfeb00ff79adbb',0,NULL,'2022-09-05 16:21:54'),(125,'cmobop26w0lf','.jpg','290184','http://192.168.31.100:8000/file/img/cmobop26w0lf.jpg','20201313013','b8320497f1195324f6c48ef9e02c3df9',0,NULL,'2022-09-05 16:25:38'),(126,'cmobpa18400a','.jpg','886295','http://192.168.31.100:8000/file/img/cmmhppyjmh5e.jpg','20201313013','e35abda0a2e99e8527c7c3dcec560566',0,NULL,'2022-09-05 16:26:24'),(127,'cmobphvwr01o','.jpg','793327','http://192.168.31.100:8000/file/img/cmobphvwr01o.jpg','20201313013','6cd8ac5ff8c0243be4db0d104827ebb9',0,NULL,'2022-09-05 16:26:41'),(128,'cmobpur1aatm','.jpg','793327','http://192.168.31.100:8000/file/img/cmobphvwr01o.jpg','20201313013','6cd8ac5ff8c0243be4db0d104827ebb9',0,NULL,'2022-09-05 16:27:09'),(129,'19gtz2k9x2hk','.jpg','886295','http://192.168.31.100:8000/file/img/cmmhppyjmh5e.jpg','20201313013','e35abda0a2e99e8527c7c3dcec560566',0,NULL,'2022-09-05 16:28:16'),(130,'cmobr6i1jtxu','.jpg','886295','http://192.168.31.100:8000/file/img/cmmhppyjmh5e.jpg','20201313013','e35abda0a2e99e8527c7c3dcec560566',0,NULL,'2022-09-05 16:28:53'),(131,'cmobr8doo50w','.jpg','1019914','http://192.168.31.100:8000/file/img/cmobr8doo50w.jpg','20201313013','529da6e672d0ae635b4fc26a46f1fd1b',0,NULL,'2022-09-05 16:28:57'),(132,'cmobsfikwit7','.jpg','1019914','http://192.168.31.100:8000/file/img/cmobr8doo50w.jpg','20201313013','529da6e672d0ae635b4fc26a46f1fd1b',0,NULL,'2022-09-05 16:30:31'),(133,'cmobsjw5j5w4','.jpg','496379','http://192.168.31.100:8000/file/img/cmobsjw5j5w4.jpg','20201313013','f7e7d66e304a4f2da851e7c4924be226',0,NULL,'2022-09-05 16:30:41'),(134,'cmobujedjcx8','.jpg','240015','http://192.168.31.100:8000/file/img/cmobujedjcx8.jpg','20201313013','4a036b53df4f8cb6c30a6b8a20b7e3ab',0,NULL,'2022-09-05 16:33:16'),(135,'cmobv7scc4ug','.jpg','399409','http://192.168.31.100:8000/file/img/cmobv7scc4ug.jpg','20201313013','a144a647f0024edc421a3c02145bbf26',0,NULL,'2022-09-05 16:34:09'),(136,'cmp2co7b1n0y','.hdslb.com_bfs_article_57847f605ee5bb8b791c220845ec6ef7b045b977.jpg&refer=http __i0.hdslb.webp','46334','http://192.168.31.100:8000/file/img/cmp2co7b1n0y.hdslb.com_bfs_article_57847f605ee5bb8b791c220845ec6ef7b045b977.jpg&refer=http __i0.hdslb.webp','20201313013','be21dfdec1691ab3bef30f5ef98da752',0,NULL,'2022-09-06 13:19:26'),(137,'cmp2cpwffeqv','.ifengimg.com_res_2021_46AD8A5B5F8CB3CEAF471C2710E379A73B24854F_size104_w1019_h657.jpeg&refer=http __x0.ifengimg.webp','61418','http://192.168.31.100:8000/file/img/cmp2cpwffeqv.ifengimg.com_res_2021_46AD8A5B5F8CB3CEAF471C2710E379A73B24854F_size104_w1019_h657.jpeg&refer=http __x0.ifengimg.webp','20201313013','8d106e0efd2e3f57ab9ba559cc35294f',0,NULL,'2022-09-06 13:19:30'),(138,'cmp2cpwg0ix1','.itc.cn_images01_20200717_f32e8bb97a854b6ca8e703685dd1b463.jpeg&refer=http __p4.itc.webp','148174','http://192.168.31.100:8000/file/img/cmp2cpwg0ix1.itc.cn_images01_20200717_f32e8bb97a854b6ca8e703685dd1b463.jpeg&refer=http __p4.itc.webp','20201313013','94ef2dbda55efd5b8511580c9933ce38',0,NULL,'2022-09-06 13:19:30'),(139,'cmp2cpwgfyw4','.hdslb.com_bfs_article_eee93084e2ce2d7dbb06cd74dedc2f405bae6efb.jpg&refer=http __i0.hdslb.webp','183650','http://192.168.31.100:8000/file/img/cmp2cpwgfyw4.hdslb.com_bfs_article_eee93084e2ce2d7dbb06cd74dedc2f405bae6efb.jpg&refer=http __i0.hdslb.webp','20201313013','29c995d5a4a2c57e3832f164c6692bf1',0,NULL,'2022-09-06 13:19:30'),(140,'cmp2cpwjer5s','.eastday.com_thumbnailimg_month_1703_455e90ec-7c2a-4bdc-ba5f-43aa6313e574.jpeg&refer=http __listen.eastday.webp','358218','http://192.168.31.100:8000/file/img/cmp2cpwjer5s.eastday.com_thumbnailimg_month_1703_455e90ec-7c2a-4bdc-ba5f-43aa6313e574.jpeg&refer=http __listen.eastday.webp','20201313013','8c904b07af58aac1db2652210419a11d',0,NULL,'2022-09-06 13:19:30'),(141,'cmwybc5jmdnu','.jpg','142331','http://192.168.31.100:8000/file/img/cmwybc5jmdnu.jpg','20201313013','b7db5e4d6ba464ea10539bc396d88e91',0,NULL,'2022-09-15 19:50:57'),(142,'cmxf41u0x885','.jpg','11108','http://192.168.31.100:8000/file/img/cmxf41u0x885.jpg','20201313014','803fb4f75b3bc12c4633127684f2e3a',0,NULL,'2022-09-16 09:00:45'),(143,'cmxo8an8yln8','.png','63140','http://192.168.31.100:8000/file/img/cmxo8an8yln8.png','20201313013','45d208e2b271589e6c6b8677d94c5a08',0,NULL,'2022-09-16 16:09:27'),(144,'cmxoazb2m4co','.png','89152','http://192.168.31.100:8000/file/img/cmxoazb2m4co.png','20201313013','e528b1d83879f242f4ba5fa97436ee0a',0,NULL,'2022-09-16 16:12:58'),(145,'cmxoazb2zr7m','.png','163172','http://192.168.31.100:8000/file/img/cmmew7oq141i.png','20201313013','b31b21dbe518dc3d35ec712d1c54bf13',0,NULL,'2022-09-16 16:12:58'),(146,'cmxvjh2rm2yd','.jpeg','1034989','http://192.168.31.100:8000/file/img/cmxvjh2rm2yd.jpeg','20201313014','d60a64d66a06d5132b88cae5030ad7fd',0,NULL,'2022-09-16 21:53:11'),(147,'cmxvjh2roenl','.jpg','6267','http://192.168.31.100:8000/file/img/cmxvjh2roenl.jpg','20201313014','593efaa8f503aa3a5172f1e1a1eaa42a',0,NULL,'2022-09-16 21:53:11'),(148,'cn0tz1vyivyl','.png','300642','http://192.168.31.100:8000/file/img/cn0tz1vyivyl.png','20201313013','3d3ab9e50f7cff639599995ad9e2f5cd',0,NULL,'2022-09-20 09:17:29'),(149,'cn2lib7majic','.jpg','95401','http://192.168.31.100:8000/file/img/cn2lib7majic.jpg','20201313013','6c3e5c3fd30154f447bc6e57be1302ae',0,NULL,'2022-09-22 11:04:49'),(150,'cn907cazq0te','.png','231990','http://localhost:8000/file/img/cn907cazq0te.png','20201313060','3d46b2c0b32533777a8682f4e90540b5',0,NULL,'2022-09-29 23:51:45'),(151,'cn9b3o1hkd4b','.jpg','2991338','http://192.168.31.100:8000/file/img/cn9b3o1hkd4b.jpg','20201313060','3b08026468758cf6f291c9c965afe886',0,NULL,'2022-09-30 08:24:10'),(152,'cn9b8yreli3b','.jpg','810552','http://192.168.31.100:8000/file/img/cn9b8yreli3b.jpg','20201313063','649dd16324f7e1d10d5f4ec21dc26e50',0,NULL,'2022-09-30 08:31:05'),(153,'cn9u6zzdlkek','.jpeg','3265','http://192.168.31.100:8000/file/img/cn9u6zzdlkek.jpeg','20201313056','671de6b66c459fe651f16632621630ad',0,NULL,'2022-09-30 23:21:52'),(154,'19j2ebvesj3y','.jpg','605629','http://192.168.31.100:8000/file/img/19j2ebvesj3y.jpg','20201313013','ebfdd7c64322428cf71b52472c333d9a',0,NULL,'2022-10-01 22:42:22'),(155,'cnb0xljsurwr','.jpg','324698','http://192.168.31.100:8000/file/img/cnb0xljsurwr.jpg','20201313013','af60cb99f0554babf4bacafea1c84f23',0,NULL,'2022-10-02 08:51:23'),(156,'cnb0xn6tiuyl','.jpg','1105828','http://192.168.31.100:8000/file/img/cnb0xn6tiuyl.jpg','20201313013','4d8046adc4ca7b90ffed76dbdd17b542',0,NULL,'2022-10-02 08:51:26'),(157,'cnc31rpb0tuw','.jpg','366168','http://192.168.31.100:8000/file/img/cnc31rpb0tuw.jpg','20201313013','855418528df628be5f0f7670051e2470',0,NULL,'2022-10-03 14:43:32'),(158,'cndkwki5tde6','.jpg','3170507','http://192.168.31.100:8000/file/img/cndkwki5tde6.jpg','20201313013','1c0e1f2b3a8d2cafb85f5e7a4f3cb782',0,NULL,'2022-10-05 08:55:44');
/*!40000 ALTER TABLE `file` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `grade`
--

DROP TABLE IF EXISTS `grade`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `grade` (
  `id` varchar(64) NOT NULL,
  `label` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='年级对应';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `grade`
--

LOCK TABLES `grade` WRITE;
/*!40000 ALTER TABLE `grade` DISABLE KEYS */;
INSERT INTO `grade` VALUES ('13','计算机');
/*!40000 ALTER TABLE `grade` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `item`
--

DROP TABLE IF EXISTS `item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `item` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(100) DEFAULT NULL,
  `createtime` timestamp NULL DEFAULT NULL,
  `description` text,
  `onsale` tinyint(1) DEFAULT '1',
  `price` double DEFAULT NULL,
  `userid` varchar(64) DEFAULT NULL,
  `visited` int DEFAULT '0',
  `sort` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `item_id_uindex` (`id`),
  KEY `item_user_id_fk` (`userid`),
  KEY `item_sort_id_fk` (`sort`),
  CONSTRAINT `item_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='物品';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `item`
--

LOCK TABLES `item` WRITE;
/*!40000 ALTER TABLE `item` DISABLE KEYS */;
INSERT INTO `item` VALUES (1,'02 mua','2022-08-22 09:53:45','我们仍未知道那天所见的花的名字',0,9.98,'20201313013',0,NULL),(2,'test','2022-08-17 13:48:25','描述',0,9.99,'20201313013',0,NULL),(3,'华为','2022-08-22 09:53:03','我们华为真是太棒啦',0,6999,'20201313013',0,NULL),(4,'羊头1','2022-08-22 10:23:01','挂羊头',1,6.66,'20201313013',0,NULL),(6,'羊头3','2022-08-22 10:23:02','挂羊头',1,6.66,'20201313013',0,NULL),(8,'狗肉1','2022-08-22 10:24:05','卖狗肉',1,9.99,'20201313013',0,NULL),(9,'狗肉2','2022-08-22 10:24:07','卖狗肉',1,9.99,'20201313013',0,NULL),(10,'狗肉3','2022-08-22 10:24:08','卖狗肉',1,9.99,'20201313013',0,NULL),(11,'狗肉4','2022-08-22 10:24:09','卖狗肉',0,9.99,'20201313013',0,NULL),(14,'西瓜','2022-08-22 22:04:10','两块钱一斤',0,200,'20201313060',0,NULL),(15,'瓶子','2022-08-22 22:04:09','扇宝那里抢来的',0,2,'20201313060',0,NULL),(16,'扇宝的瓶子','2022-08-22 15:44:55','桥洞',0,200,'20201313090',0,NULL),(17,'外卖2','2022-08-22 15:54:07','外卖',0,123,'20201313060',0,NULL),(18,'羊头5','2022-08-25 21:07:54','测试',1,NULL,'20201313013',0,NULL),(19,'狗肉5','2022-08-25 21:07:54','测试',0,NULL,'20201313013',0,NULL),(21,'1女生自用99新GT610疯牛病版核弹','2022-08-30 16:16:35','一共十张',1,99,'20201313013',0,NULL),(22,'2女生自用GTX690战术核显卡','2022-08-30 16:17:42','一发可以就可以击沉一艘航母',1,499,'20201313014',0,NULL),(23,'3伊拉克战损版3090','2022-08-30 16:18:31','售后不退',1,599,'20201313014',0,NULL),(26,'4全新3090没有挖过矿的那种','2022-08-30 16:20:03','真的没有挖过矿',1,3090,'20201313013',0,NULL),(27,'5正品七彩虹3090略有弯折嫌弃勿扰','2022-08-30 16:21:09','稍微磕了一下',1,4999,'20201313013',0,NULL),(28,'5华硕ROG全家桶3090','2022-08-30 16:22:16','仅显卡',1,3090,'20201313014',0,NULL),(31,'测试','2022-09-01 13:57:03','这是测试用的描述',1,0,'优菈',0,NULL),(32,'测试','2022-09-01 13:57:29','1',1,1,'优菈',0,NULL),(33,'测试','2022-09-01 14:01:51','这是测试用的描述',1,0,'优菈',0,NULL),(34,'测试','2022-09-01 14:02:53','这是测试用的描述',1,0,'优菈',0,NULL),(35,'测试','2022-09-01 14:04:25','这是测试用的描述',1,0,'优菈',0,NULL),(36,'测试','2022-09-01 14:04:39','这是测试用的描述',1,0,'优菈',0,NULL),(37,'测试','2022-09-01 14:04:54','这是测试用的描述',1,0,'优菈',0,NULL),(43,'测试','2022-09-01 14:22:06','这是测试用的描述',1,0,'优菈',0,NULL),(44,'测试','2022-09-01 14:25:31','这是测试用的描述',1,0,'优菈',0,NULL),(45,'测试','2022-09-01 14:26:54','这是测试用的描述',1,0,'优菈',0,NULL),(46,'测试','2022-09-01 14:27:31','这是测试用的描述',1,0,'优菈',0,NULL),(47,'测试','2022-09-01 14:32:22','这是测试用的描述',1,0,'优菈',0,NULL),(48,'测试','2022-09-01 14:35:04','这是测试用的描述',1,0,'优菈',0,NULL),(49,'测试','2022-09-01 14:35:52','这是测试用的描述',1,0,'优菈',0,NULL),(50,'测试','2022-09-01 14:38:13','这是测试用的描述',1,0,'优菈',0,NULL),(51,'测试','2022-09-01 14:38:59','这是测试用的描述',1,0,'优菈',0,NULL),(52,'测试','2022-09-01 14:41:36','这是测试用的描述',1,0,'优菈',0,NULL),(53,'测试','2022-09-01 14:42:53','这是测试用的描述',1,0,'优菈',0,NULL),(54,'测试','2022-09-01 14:47:52','这是测试用的描述',1,0,'优菈',0,NULL),(55,'a','2022-09-02 17:47:01','asd',1,123,NULL,0,NULL),(56,'a','2022-09-02 17:47:02','asd',1,123,NULL,0,NULL),(58,'测试物品','2022-09-02 18:42:16','测试物品',1,114,'20201313013',0,NULL),(59,'测试物品2','2022-09-02 18:44:06','2',1,114,'20201313013',0,NULL),(60,'测试3','2022-09-02 19:14:09','物品3',1,333,'20201313013',0,NULL),(61,'测试3','2022-09-03 09:36:44','测试3',1,33,'20201313013',0,NULL),(62,'测试4','2022-09-03 09:37:19','测试4',1,44,'20201313013',0,NULL),(63,'测试4','2022-09-03 10:31:26','米斯达啊啊啊啊',1,444,'20201313013',2,NULL),(64,'测试5','2022-09-03 11:10:42','5',1,555,'20201313013',0,NULL),(65,'女生自用略有磨损99新3090显卡售后退','2022-09-03 12:20:47','我是矿老板',1,3090,'20201313013',0,NULL),(66,'我倒要试试varchar256到底有多长长','2022-09-03 12:35:19','aa',1,114,'20201313013',1,NULL),(67,'一二三四五六七八九十','2022-09-03 12:39:06','a',1,100,'20201313013',0,NULL),(68,'我要是传俩图咋办呢','2022-09-03 12:42:24','aa',1,1456,'20201313013',1,NULL),(70,'这次真的是两张图','2022-09-03 12:46:30','1223',1,11,'20201313013',2,NULL),(71,'两张图的bug修好了','2022-09-03 18:26:18','真的好了吗？？',1,1145,'20201313013',3,NULL),(72,'扇宝的瓶子','2022-09-05 15:46:23','刚从扇宝桥洞那里毛的',1,1,'20201313013',7,NULL),(73,'测试上传草稿','2022-09-05 16:28:59','这次应该成功了吧',0,114,'20201313013',1,NULL),(74,'再次测试上传草稿','2022-09-05 16:30:43','这次应该成功了吧',1,1145,'20201313013',13,NULL),(75,'最后一次测试上传草稿','2022-09-05 16:33:18','121313213',0,13,'20201313013',0,NULL),(76,'最最最后一次测试上传草稿','2022-09-05 16:34:11','114',0,123,'20201313013',0,NULL),(77,'物品页面测试【这是我刚提的新车啊】','2022-09-06 13:19:36','我滴新车啊',1,114.514,'20201313013',139,NULL),(78,'这是第78个物品','2022-09-15 19:47:23','九九新',0,78,'20201313013',1,NULL),(79,'怎么上传不了图片','2022-09-21 23:18:41','bbbbbbbb',1,120,'20201313013',42,'手机'),(80,'仙贝上传了一个物品','2022-09-20 10:51:29','这是一个有味道的物品',1,114.5,'20201313014',19,'牙刷'),(81,'这是一个新的物品','2022-09-20 10:49:50','1111',1,100,'20201313013',10,'牙刷'),(82,'先辈又上传了一个物品','2022-09-20 10:56:14','哼哼哼啊啊啊啊啊',1,100,'20201313014',27,'牙刷'),(83,'上传了一个带分类的物品','2022-09-20 09:17:33','美国有苹果，中国有菠萝',0,6,'20201313013',0,'手机'),(84,'8848钛金手机','2022-09-22 11:04:50','澳洲进口小牛皮',1,8848,'20201313013',55,'手机'),(85,'王渤','2022-09-29 23:52:57','新品',1,1,'20201313057',12,'手机'),(86,'孙树测试','2022-09-29 23:54:32','小王渤一手电脑',1,999,'20201313057',30,'电脑'),(87,'牛子','2022-09-30 08:31:14','牛子天上来',0,9998,'20201313063',1,'杯子'),(88,'随便','2022-09-30 23:22:03','1234567',1,999,'20201313056',14,'书籍'),(89,'新建一个东西','2022-10-03 14:43:33','啊啊啊啊啊',1,666,'20201313013',15,'牙刷'),(90,'赛马娘现货换头凯露','2022-10-05 08:55:46','哈哈',1,666,'20201313013',4,'牙刷');
/*!40000 ALTER TABLE `item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `itempic`
--

DROP TABLE IF EXISTS `itempic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `itempic` (
  `picid` int DEFAULT NULL,
  `itemid` int DEFAULT NULL,
  `ishead` int DEFAULT NULL,
  KEY `itempic_file_id_fk` (`picid`),
  KEY `itempic_item_id_fk` (`itemid`),
  CONSTRAINT `itempic_file_id_fk` FOREIGN KEY (`picid`) REFERENCES `file` (`id`),
  CONSTRAINT `itempic_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='物品图片对照';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `itempic`
--

LOCK TABLES `itempic` WRITE;
/*!40000 ALTER TABLE `itempic` DISABLE KEYS */;
INSERT INTO `itempic` VALUES (40,21,1),(41,22,1),(42,23,1),(43,26,1),(44,27,1),(45,28,1),(89,63,1),(90,64,1),(91,65,1),(92,66,1),(93,67,1),(94,68,1),(98,70,1),(99,70,NULL),(118,71,1),(119,71,NULL),(121,72,1),(130,73,1),(131,73,NULL),(133,74,1),(134,75,1),(135,76,1),(136,77,1),(137,77,NULL),(138,77,NULL),(139,77,NULL),(140,77,NULL),(141,79,1),(142,80,1),(143,81,1),(146,82,1),(147,82,NULL),(148,83,1),(149,84,1),(152,87,1),(153,88,1),(157,89,1),(158,90,1);
/*!40000 ALTER TABLE `itempic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rollimg`
--

DROP TABLE IF EXISTS `rollimg`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rollimg` (
  `url` varchar(255) DEFAULT NULL,
  `id` int NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`),
  UNIQUE KEY `rollimg_id_uindex` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='轮播图';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rollimg`
--

LOCK TABLES `rollimg` WRITE;
/*!40000 ALTER TABLE `rollimg` DISABLE KEYS */;
INSERT INTO `rollimg` VALUES ('https://img.hasdsd.cn/img/ASOUL-天选同萌秀出高能.jpg',10),('https://img.hasdsd.cn/img/天选姬静态PC“森林精灵”.jpg',11),('https://img.hasdsd.cn/img/天选姬静态PC“国风”-2.jpg',12),('https://img.hasdsd.cn/img/天选姬静态PC“新年”.jpg',13),('https://img.hasdsd.cn/img/天选姬静态PC“水着天选姬”.jpg',14);
/*!40000 ALTER TABLE `rollimg` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rootuser`
--

DROP TABLE IF EXISTS `rootuser`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `rootuser` (
  `id` varchar(64) DEFAULT NULL,
  `username` varchar(64) DEFAULT NULL,
  `password` varchar(64) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='root用户';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rootuser`
--

LOCK TABLES `rootuser` WRITE;
/*!40000 ALTER TABLE `rootuser` DISABLE KEYS */;
INSERT INTO `rootuser` VALUES ('root','大森罗万象断罪之皇女','114514');
/*!40000 ALTER TABLE `rootuser` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sort`
--

DROP TABLE IF EXISTS `sort`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sort` (
  `id` int NOT NULL AUTO_INCREMENT,
  `label` varchar(64) DEFAULT NULL,
  `name` varchar(64) DEFAULT NULL,
  `icon` varchar(64) DEFAULT NULL,
  `pid` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='分类';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sort`
--

LOCK TABLES `sort` WRITE;
/*!40000 ALTER TABLE `sort` DISABLE KEYS */;
INSERT INTO `sort` VALUES (1,'everyday','生活用品','nightlife',NULL),(2,'electronic','电子产品','devices',NULL),(3,'study','学习用品','menu_book',NULL),(4,'phone','手机','phone_iphone',2),(5,'pad','平板','tablet_mac',2),(19,'laptop','电脑','laptop',2),(20,'brush','牙刷','brush',1),(22,'cup','杯子','free_breakfast',1),(23,'book','书籍','import_contacts',3);
/*!40000 ALTER TABLE `sort` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tablemenu`
--

DROP TABLE IF EXISTS `tablemenu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tablemenu` (
  `field` varchar(64) DEFAULT NULL COMMENT '表格属性',
  `label` varchar(64) DEFAULT NULL COMMENT '表格对应中文名',
  `tablename` varchar(64) DEFAULT NULL COMMENT '所属表格',
  `name` varchar(64) DEFAULT NULL COMMENT '特殊表格定制'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='表格属性对照';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tablemenu`
--

LOCK TABLES `tablemenu` WRITE;
/*!40000 ALTER TABLE `tablemenu` DISABLE KEYS */;
INSERT INTO `tablemenu` VALUES ('id','学号','user',NULL),('nickname','昵称','user',NULL),('realname','真实名称','user',NULL),('phone','手机号','user',NULL),('createtime','创建/修改时间','user',NULL),('id','物品id','item',NULL),('title','物品名称','item','name'),('createtime','创建/修改时间','item',NULL),('description','描述','item',NULL),('onsale','上架','item','enablesale'),('price','价格','item',NULL),('userid','上传者id','item',NULL),('id','评论id','comment',NULL),('itemid','物品id','comment',NULL),('userid','用户id','comment',NULL),('createtime','创建时间','comment',NULL),('content','文本内容','comment',NULL),('fromcommentid','父级评论','comment',NULL),('id','图片id','picdto',NULL),('name','文件名','picdto',NULL),('url','链接','picdto',NULL),('userid','学号','picdto',NULL),('createtime','创建时间','picdto',NULL),('is_delete','可用状态','picdto','enablepic'),('id','订单id','order',''),('userid','用户id','order',NULL),('itemid','商品id','order',NULL),('enable','可用','order','enable'),('status','状态','order','status'),('createtime','创建时间','order',NULL),('id','分类id','psort',NULL),('name','名称','psort',NULL),('id','分类id','nsort',NULL),('name','名称','nsort',NULL),('pid','父级id','nsort','nsort'),('icon','图标','psort',NULL),('icon','图标','nsort',NULL),('check','操作','psort','psort'),('id','图片ID','rollimg','id'),('url','图片URL','rollimg','url'),('sort','分类','item',NULL),('touserid','回复用户','comment',NULL),('infoid','认证id','user',NULL),('URI','请求地址','URL','URI'),('RequestCount','请求次数','URL','RequestCount'),('ConcurrentMax','最大并发','','ConcurrentMax'),('RequestTimeMillisMax','单次最慢','URL','RequestTimeMillisMax'),('JdbcExecuteErrorCount','JDBC出错数','URL','JdbcExecuteErrorCount'),('JdbcExecuteCount','JDBC执行数','URL','JdbcExecuteCount'),('JdbcFetchRowCount','读取行数','URL','JdbcFetchRowCount'),('RemoteAddress','IP地址','Session','RemoteAddress'),('RequestCount','请求次数','Session','RequestCount'),('ConcurrentMax','最大并发','Session','ConcurrentMax'),('CreateTime','创建时间','Session','CreateTime'),('LastAccessTime','最后访问时间','Session','LastAccessTime');
/*!40000 ALTER TABLE `tablemenu` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `id` varchar(64) NOT NULL COMMENT '学号',
  `nickname` varchar(64) DEFAULT NULL,
  `realname` varchar(64) DEFAULT NULL COMMENT '真实姓名',
  `password` varchar(255) DEFAULT NULL COMMENT '密码',
  `avatar` varchar(255) DEFAULT NULL COMMENT '用户头像地址',
  `createtime` timestamp NULL DEFAULT NULL COMMENT '创建日期',
  `phone` varchar(64) DEFAULT NULL COMMENT '手机号',
  `infoid` int NOT NULL AUTO_INCREMENT COMMENT '聊天用id',
  PRIMARY KEY (`id`),
  UNIQUE KEY `user_id_uindex` (`id`),
  UNIQUE KEY `infoId` (`infoid`)
) ENGINE=InnoDB AUTO_INCREMENT=203 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('20201313013','田所浩三','田所浩三','114514','https://img.hasdsd.cn/img/微信图片_20220831090512.jpg','2022-08-16 12:38:42','123456',10),('20201313014','田所浩二','田所浩二','114514','https://img.hasdsd.cn/img/QQ图片20220908072517.jpg','2022-08-16 12:38:42','123456',11),('20201313056','随便','随便','123456',NULL,'2022-09-30 23:20:31',NULL,202),('20201313057','田所浩二','田所浩二','123456','https://img.hasdsd.cn/img/QQ截图20220928203640.png','2022-09-29 23:47:03','132456',201),('20201313059','田所浩二','田所浩二','114514','https://img.hasdsd.cn/img/QQ截图20220923130721.png','2022-09-23 13:08:07','123456',15),('20201313060','田所浩二','田所浩二','114514','https://img.hasdsd.cn/img/QQ截图20220928203640.png','2022-08-16 19:52:38','123456',12),('20201313061','田所浩二','田所浩二','114514',NULL,'2022-08-16 19:52:37','123456',4),('20201313062','田所浩二','田所浩二','114514',NULL,'2022-08-16 19:52:38','123456',5),('20201313063','田所浩二','田所浩二','114514',NULL,'2022-08-16 19:52:39','123456',6),('20201313064','田所浩二','田所浩二','114514',NULL,'2022-08-16 19:52:36','123456',7),('20201313065','田所浩二','田所浩二','114514',NULL,'2022-08-16 19:52:37','123456',8),('20201313066','田所浩二','田所浩二','114514',NULL,'2022-08-16 19:52:36','123456',9),('20201313067','田所浩二','田所浩二','114514','https://img.hasdsd.cn/img/QQ截图20220929090006.png','2022-08-16 12:38:42','123456',14),('20201313068','田所浩二','田所浩二','114514','https://img.hasdsd.cn/img/QQ截图20220929090022.png','2022-08-16 12:38:42','123456',19),('20201313069','田所浩二','田所浩二','114514',NULL,'2022-08-16 12:38:42','123456',200),('20201313090','田所浩二','田所浩二','114514','https://img.hasdsd.cn/img/QQ截图20220929090030.png','2022-08-16 12:38:42','123456',17),('优菈','记仇真君','优菈·劳伦斯','123456','https://img.hasdsd.cn/img/QQ截图20220929090014.png','2022-08-27 16:43:18','uu',16);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `usercollect`
--

DROP TABLE IF EXISTS `usercollect`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `usercollect` (
  `userid` varchar(64) DEFAULT NULL,
  `itemid` int DEFAULT NULL,
  KEY `usercollect_item_id_fk` (`itemid`),
  KEY `usercollect_user_id_fk` (`userid`),
  CONSTRAINT `usercollect_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`),
  CONSTRAINT `usercollect_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户收藏';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `usercollect`
--

LOCK TABLES `usercollect` WRITE;
/*!40000 ALTER TABLE `usercollect` DISABLE KEYS */;
INSERT INTO `usercollect` VALUES ('20201313063',14),('20201313063',15),('20201313063',16),('优菈',1),('优菈',1),('20201313013',17),('20201313013',10),('20201313063',77),('20201313014',75),('20201313013',67),('20201313013',70),('20201313013',68),('20201313013',76),('20201313013',74),('20201313013',73),('20201313013',77),('20201313014',82),('20201313014',77),('20201313013',82),('20201313013',83),('20201313063',87),('20201313057',87),('20201313059',79),('20201313059',84),('20201313013',79);
/*!40000 ALTER TABLE `usercollect` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `userhistory`
--

DROP TABLE IF EXISTS `userhistory`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `userhistory` (
  `userid` varchar(64) DEFAULT NULL,
  `itemid` int DEFAULT NULL,
  `createtime` timestamp NULL DEFAULT NULL,
  `id` int NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`),
  KEY `userhistory_item_id_fk` (`itemid`),
  KEY `userhistory_user_id_fk` (`userid`),
  CONSTRAINT `userhistory_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`),
  CONSTRAINT `userhistory_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=74 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户浏览历史';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `userhistory`
--

LOCK TABLES `userhistory` WRITE;
/*!40000 ALTER TABLE `userhistory` DISABLE KEYS */;
INSERT INTO `userhistory` VALUES ('20201313013',71,'2022-10-01 23:01:56',19),('20201313013',77,'2022-10-01 22:39:33',20),('20201313013',74,'2022-10-01 23:00:19',21),('20201313013',76,'2022-09-19 11:22:22',22),('20201313013',78,'2022-09-16 11:39:13',23),('20201313013',79,'2022-10-03 14:44:35',24),('20201313013',73,'2022-09-16 08:18:23',25),('20201313014',79,'2022-09-16 08:58:31',26),('20201313014',80,'2022-09-16 21:51:24',27),('20201313013',80,'2022-10-02 09:03:59',28),('20201313014',77,'2022-09-17 10:15:28',29),('20201313014',76,'2022-09-17 10:49:57',30),('20201313013',75,'2022-10-01 10:17:22',31),('20201313013',72,'2022-10-01 22:41:40',32),('20201313013',81,'2022-10-02 11:48:20',33),('20201313014',81,'2022-09-16 22:21:12',34),('20201313014',82,'2022-10-05 08:57:52',35),('20201313014',75,'2022-09-17 10:50:02',36),('20201313013',82,'2022-10-05 08:57:13',37),('20201313013',83,'2022-10-01 10:18:12',38),('20201313013',68,'2022-09-20 09:18:49',39),('20201313013',70,'2022-09-20 09:18:59',40),('20201313013',84,'2022-10-05 08:57:01',41),('20201313060',84,'2022-09-29 23:34:59',42),('20201313057',85,'2022-09-29 23:55:33',43),('20201313057',84,'2022-09-29 23:53:43',44),('20201313057',86,'2022-09-29 23:56:13',45),('20201313059',86,'2022-10-05 11:22:35',46),('20201313060',86,'2022-09-30 08:09:32',47),('20201313063',87,'2022-09-30 08:32:50',48),('20201313059',87,'2022-09-30 22:35:48',49),('20201313057',87,'2022-09-30 08:32:04',50),('20201313059',79,'2022-10-05 11:25:22',51),('20201313059',84,'2022-10-05 11:22:21',52),('20201313059',80,'2022-10-05 11:22:30',53),('20201313059',85,'2022-10-03 15:05:51',54),('20201313059',82,'2022-10-05 10:08:11',55),('20201313013',88,'2022-10-05 08:56:55',56),('20201313056',86,'2022-09-30 23:22:24',57),('20201313056',85,'2022-09-30 23:22:36',58),('20201313013',85,'2022-10-01 21:31:50',59),('20201313014',84,'2022-10-01 08:19:14',60),('20201313013',63,'2022-10-01 20:46:08',61),('20201313013',86,'2022-10-02 11:47:57',62),('20201313059',74,'2022-10-05 11:24:42',63),('20201313059',66,'2022-10-01 22:11:37',64),('20201313013',89,'2022-10-05 10:19:31',65),('20201313014',89,'2022-10-03 14:44:56',66),('20201313059',89,'2022-10-05 11:24:28',67),('20201313059',77,'2022-10-05 10:07:57',68),('20201313059',72,'2022-10-03 15:04:03',69),('20201313013',90,'2022-10-05 08:56:10',70),('20201313059',81,'2022-10-05 11:24:34',71),('20201313059',90,'2022-10-05 11:25:13',72),('20201313059',63,'2022-10-05 11:25:07',73);
/*!40000 ALTER TABLE `userhistory` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `userlike`
--

DROP TABLE IF EXISTS `userlike`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `userlike` (
  `userid` varchar(64) NOT NULL,
  `itemid` int NOT NULL,
  KEY `userlike_item_id_fk` (`itemid`),
  KEY `userlike_user_id_fk` (`userid`),
  CONSTRAINT `userlike_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`),
  CONSTRAINT `userlike_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='点赞';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `userlike`
--

LOCK TABLES `userlike` WRITE;
/*!40000 ALTER TABLE `userlike` DISABLE KEYS */;
INSERT INTO `userlike` VALUES ('20201313060',77),('20201313013',77),('20201313013',76),('20201313013',70),('20201313063',77),('20201313014',77),('20201313013',74),('20201313013',68),('20201313013',67),('20201313013',73),('20201313013',80),('20201313013',83),('20201313013',79),('20201313013',84),('20201313013',82),('20201313059',86),('20201313063',87),('20201313057',87),('20201313059',87),('20201313059',84),('20201313013',63),('20201313013',88),('20201313059',89),('20201313059',77);
/*!40000 ALTER TABLE `userlike` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `userorder`
--

DROP TABLE IF EXISTS `userorder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `userorder` (
  `id` int NOT NULL AUTO_INCREMENT,
  `userid` varchar(64) DEFAULT NULL COMMENT '商家userid',
  `itemid` int DEFAULT NULL,
  `enable` int DEFAULT '1',
  `status` int DEFAULT '1',
  `createtime` timestamp NULL DEFAULT NULL,
  `touserid` varchar(64) DEFAULT NULL,
  `updatetime` timestamp NULL DEFAULT NULL,
  `price` double DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`),
  KEY `order_user_id_fk` (`userid`),
  KEY `order_item_id_fk` (`itemid`),
  KEY `userorder_user_id_fk` (`touserid`),
  CONSTRAINT `order_item_id_fk` FOREIGN KEY (`itemid`) REFERENCES `item` (`id`),
  CONSTRAINT `order_user_id_fk` FOREIGN KEY (`userid`) REFERENCES `user` (`id`),
  CONSTRAINT `userorder_user_id_fk` FOREIGN KEY (`touserid`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=43 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户订单';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `userorder`
--

LOCK TABLES `userorder` WRITE;
/*!40000 ALTER TABLE `userorder` DISABLE KEYS */;
INSERT INTO `userorder` VALUES (34,'20201313013',77,1,2,'2022-09-17 10:17:39','20201313014',NULL,150),(35,'20201313013',76,1,3,'2022-09-17 10:50:17','20201313014',NULL,100),(36,'20201313013',81,0,1,'2022-09-17 21:44:00','20201313014',NULL,0),(37,'20201313057',86,1,1,'2022-09-29 23:56:13','20201313059',NULL,50),(38,'20201313063',87,1,1,'2022-09-30 08:32:45','20201313057',NULL,10),(39,'20201313063',87,1,2,'2022-09-30 08:32:49','20201313059',NULL,11),(40,'20201313013',77,1,1,'2022-10-01 22:39:32','20201313063',NULL,97),(41,'20201313013',89,1,2,'2022-10-03 14:45:28','20201313014',NULL,0),(42,'20201313014',82,1,2,'2022-10-05 08:57:52','20201313013',NULL,250);
/*!40000 ALTER TABLE `userorder` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-10-06  2:23:47
